# Homebrew Bundle — macOS
# Run: brew bundle install --file=os/macos/Brewfile
# Add packages here and run `chezmoi apply` to trigger run_onchange_install-packages.

# ── Taps ──────────────────────────────────────────────────────────────────────
# tap "homebrew/cask-fonts" # deprecated

# ── Base formulae ─────────────────────────────────────────────────────────────
brew "bat"             # better cat (with syntax highlighting)
brew "bitwarden-cli"   # CLI for Bitwarden
brew "chezmoi"         # Tool to manage dotfiles across multiple machines
brew "coreutils"       # GNU File, Shell, and Text utilities
brew "curl"            # Get a file from an HTTP, HTTPS or FTP server
brew "eza"             # better ls
brew "fd"              # fast find
brew "fzf"             # fuzzy finder
brew "gh"              # GitHub CLI
brew "git-delta"       # better git diff output
brew "git"             # Distributed revision control system
brew "gum"             # Tool for glamorous shell scripts
brew "htop"            # interactive process viewer
brew "lazygit"         # TUI git client
brew "make"            # Utility for directing compilation
brew "ncdu"            # ncurses-based disk usage
brew "neovim"          # editor
brew "ollama"          # CLI to create, run, and share large language models (LLMs) locally
brew "rage"            # modern encryption (used by chezmoi for secrets)
brew "ripgrep"         # fast grep (rg)
brew "rust"            # Rust programming language
brew "tldr"            # simplified man pages
brew "tmux"            # terminal multiplexer
brew "tree"            # directory tree
brew "watch"           # Executes a program periodically, showing output fullscreen
brew "wget"            # Internet file retriever
brew "zoxide"          # better cd — learns your most-used dirs (provides `z`)

# ── Fonts ─────────────────────────────────────────────────────────────────────
brew "font-0xproto-nerd-font"

# ── Version control and development ──────────────────────────────────────────
brew "git"
brew "lazygit"
brew "pre-commit" # Python-based framework for managing multi-language pre-commit hooks

# ── Python development ───────────────────────────────────────────────────────
brew "ruff"
brew "uv"
brew "ty"

# ── macOS formulae ────────────────────────────────────────────────────────────
brew "duti" if OS.mac? # Tool to select default apps for documetns and URL schemes on macOS
brew "findutils"       # Collection of GNU find, xargs, and locate
brew "grep"            # GNU grep, egrep and fgrep
brew "jq"              # JSON processor

# ── macOS casks ───────────────────────────────────────────────────────────────
cask "displaylink"            # only if on a laptop
cask "git-credential-manager" # Cross-platform Git credential storage for multiple hosting providers
cask "linear-linear"          # App to manage software development and track bugs, TileDB-specific
cask "logi-options+"          # Software for Logitech devices
cask "ollama-app"
cask "protonvpn"
cask "rectangle" if OS.mac?   # Window manager for macOS to move and resize windows
cask "signal"
cask "visual-studio-code"     # Open-source code editor

# ── Linux formulae ────────────────────────────────────────────────────────────

# ── Work formulae ─────────────────────────────────────────────────────────────
brew "aha" # ANSI HTML adapter - dump terminal output to an HTML file
brew "awscli" # Official Amazon AWS command-line interface
brew "cmake" # Cross-platform make
brew "coreutils" # GNU File, Shell, and Text utilities
brew "helm" # Kubernetes package manager
brew "htmltest"       # HTML validator written in Go
brew "kubernetes-cli" # Kubernetes command-line interface
brew "minikube" # Run a Kubernetes cluster locally
brew "node" # Open-source, cross-platform JavaScript runtime environment
brew "r" # Software environment for statistical computing
brew "vale" # Syntax-aware linter for prose
brew "wireguard-tools" # Tools for the WireGuard secure network tunnel

# ── Work casks ────────────────────────────────────────────────────────────────
cask "1password"
cask "1password-cli"
cask "claude" if OS.mac? # Anthropic's official Claude AI desktop app 
cask "claude-code" # Terminal-based AI coding assistant
cask "notion" # App to write, plan, collaborate, and get organised, TileDB-specific
cask "slack"
cask "thunderbird" # Mozilla's mail client

cask "zoom" # Meeting

# ── Secrets ───────────────────────────────────────────────────────────────────
brew "bitwarden-cli"   # `bw` — personal secrets on all machines


# ── Fonts (Nerd Fonts for terminal icons) ─────────────────────────────────────
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code-nerd-font"

# ── Applications ──────────────────────────────────────────────────────────────
# Uncomment the apps you want installed on this profile.
# cask "iterm2"
# cask "visual-studio-code"
# cask "1password"
# cask "firefox"
# cask "rectangle"       # window manager
# cask "raycast"         # Spotlight replacement

# ── Cargo crates ───────────────────────────────────────────────────────────────

# ── VS Code extensions ────────────────────────────────────────────────────────

vscode "esbenp.prettier-vscode"
vscode "gruntfuggly.todo-tree"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "quarto.quarto"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "tamasfe.even-better-toml"
vscode "wayou.vscode-todo-highlight"
vscode "yzhang.markdown-all-in-one"

## ── Python ────────────────────────────────────────────────────────
vscode "astral-sh.ty" # ty type checker for Python
vscode "charliermarsh.ruff"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "njpwerner.autodocstring" # Generate Python docstrings automatically

## ── Personal ────────────────────────────────────────────────────────
vscode "github.copilot-chat"

## ── Work ────────────────────────────────────────────────────────
vscode "chrischinchilla.vale-vscode"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "quarto.quarto" # TileDB-specific
vscode "redhat.vscode-xml" # XML language support
vscode "sibiraj-s.vscode-scss-formatter"
vscode "tim-koehler.helm-intellisense" # IntelliSense support for Helm templates

# ── Flatpak packages ────────────────────────────────────────────────────────
flatpak "app.zen_browser.zen"
flatpak "com.adilhanney.saber" # Notetaking app for Linux with stylus support
flatpak "com.bitwarden.desktop" if OS.linux?
flatpak "com.github.flxzt.rnote" # Another notetaking app for Linux with stylus support
flatpak "com.rafaelmardojai.Blanket" # Sleep sounds
flatpak "com.rustdesk.RustDesk", remote: "rustdesk-origin"
flatpak "com.rustdesk.RustDesk"
flatpak "io.github.finefindus.Hieroglyphic"
flatpak "net.cozic.joplin_desktop" if OS.linux?
# flatpak "net.hypatiaproject.Hypatia" # removed
flatpak "org.gnome.Extensions", remote: "fedora", url: "oci+https://registry.fedoraproject.org"
flatpak "org.gnome.gitlab.somas.Apostrophe", remote: "fedora", url: "oci+https://registry.fedoraproject.org" # Markdown editor
flatpak "org.libreoffice.LibreOffice", remote: "fedora", url: "oci+https://registry.fedoraproject.org"
